Problem Statement No. 02
Perform the following operations on Age-Income dataset (Age-Income-Dataset.csv)

Provide summary statistics (mean, median, minimum, maximum, standard deviation) for numeric variables with and without using any library functions.

Provide summary statistics of income grouped by the age groups. Create a list that contains a numeric value for each response to the categorical variable.

In [1]:
import pandas as pd

In [2]:
df = pd.read_excel("Datasets/Age-Income-Dataset.xlsx")

In [4]:
df.head()

          Age  Income
0       Young   25000
1  Middle Age   54000
2         Old   60000
3       Young   15000
4       Young   45000

In [21]:
# Without using any library fubctions
sum = 0
count = 0

for i in df["Income"]:
    sum += i
    count += 1

mean = sum/count
mean

50966.0

In [25]:
df["Income"].mean()

50966.0

In [17]:
sorted_data = sorted(df["Income"])

In [18]:
if(count%2==0):
    #even
    median = (sorted_data[(count//2)-1] + sorted_data[(count//2)]) / 2
else:
    median = sorted_data[(count//2)-1]

In [19]:
median

46850.0

In [24]:
df["Income"].median()

46850.0

In [29]:
min = df["Income"][0]
for i in df["Income"]:
    if i < min:
        min = i

min

15000

In [30]:
df["Income"].min()

15000

In [33]:
max = df["Income"][0]
for i in df["Income"]:
    if i > max:
        max = i

max

93000

In [34]:
df["Income"].max()

93000

In [60]:
std_dev_sum = 0
for i in df["Income"]:
    std_dev_sum += (i-mean)*(i-mean)
std_dev = (std_dev_sum/(count-1))**0.5
std_dev

21096.683267707253

In [54]:
df["Income"].std()

21096.683267707253

In [90]:
temp = df.groupby("Age").describe()
temp

           Income
            count          mean           std      min      25%      50%
Age
Middle Age   15.0  52453.333333  20497.800114  25600.0  36900.0  53200.0  \
Old          19.0  53942.105263  20868.165968  24500.0  38700.0  45300.0
Young        16.0  46037.500000  22356.859499  15000.0  28750.0  41500.0


                75%      max
Age
Middle Age  61200.0  93000.0
Old         71400.0  89700.0
Young       65850.0  87000.0

In [92]:
temp = temp["Income"]
temp

,count,mean,std,min,25%,50%,75%,max
Age,,,,,,,,
Middle Age,15.0,52453.333333,20497.800114,25600.0,36900.0,53200.0,61200.0,93000.0
Old,19.0,53942.105263,20868.165968,24500.0,38700.0,45300.0,71400.0,89700.0
Young,16.0,46037.500000,22356.859499,15000.0,28750.0,41500.0,65850.0,87000.0

In [121]:
temp[:]

,count,mean,std,min,25%,50%,75%,max
Age,,,,,,,,
Old,19.0,53942.105263,20868.165968,24500.0,38700.0,45300.0,71400.0,89700.0
Young,16.0,46037.500000,22356.859499,15000.0,28750.0,41500.0,65850.0,87000.0